smp-client/docs/C03_CVB_Step3_Resume_SOAP_broadband_and_voice.xml

<!--
C03_CVB_Step3_Resume_SOAP_broadband_and_voice.xml
This request will come from TRIPLE

Following services will be resumed:
1. smp_voice_line and its child services
	- smp_switch_dial_tone_access	-along with update on cos restrict id
	- smp_switch_feature_pkg_std
2. cable_broadband and its child services
	- internet_access	-along with update on product code
	-std_cpe
	-static_ip(optional if present)
	-additional_cpe(optional if present)
-->
<!-- $Id: C03_CVB_Step3_Resume_SOAP_broadband_and_voice.xml,v 1.1 2009/11/23 13:29:25 varshag Exp $ -->
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
<SOAP-ENV:Body>
<m:executeXml xmlns:m="http://www.sigma-systems.com/schemas/3.1/SmpXmlOrderAPI" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <xmlRequest xsi:type="xsd:string">&lt;smpsa:executeOrderRequest xmlns:smpsa=&quot;http://www.sigma-systems.com/schemas/3.1/SmpServiceActivationSchema&quot; xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot; xmlns:cmn=&quot;http://java.sun.com/products/oss/xml/Common&quot; xmlns:sa=&quot;http://java.sun.com/products/oss/xml/ServiceActivation&quot; xmlns:smpcbe=&quot;http://www.sigma-systems.com/schemas/3.1/SmpCBECoreSchema&quot; xmlns:smpcmn=&quot;http://www.sigma-systems.com/schemas/3.1/SmpCommonValues&quot; xmlns:cbesvc=&quot;http://java.sun.com/products/oss/xml/CBE/Service&quot;&gt;
  &lt;smp:orderValue xmlns:smp=&quot;http://www.sigma-systems.com/schemas/3.1/SmpServiceActivationSchema&quot; xsi:type=&quot;smp:ActionOrderValue&quot;&gt;
    &lt;cmn:lastUpdateVersionNumber&gt;-1&lt;/cmn:lastUpdateVersionNumber&gt;
    &lt;sa:apiClientId&gt;web&lt;/sa:apiClientId&gt;
    &lt;sa:orderKey xsi:type=&quot;smp:OrderKeyType&quot;&gt;
      &lt;cmn:type&gt;com.sigma.samp.cmn.order.SampOrderKey&lt;/cmn:type&gt;
      &lt;sa:primaryKey&gt;-1&lt;/sa:primaryKey&gt;
    &lt;/sa:orderKey&gt;
    &lt;sa:priority&gt;3&lt;/sa:priority&gt;
    &lt;sa:orderState smpState=&quot;open.not_running.not_started&quot; xsi:type=&quot;smp:SubOrderStateType&quot;&gt;open.not_running.not_started&lt;/sa:orderState&gt;
    &lt;smp:subKey&gt;
      &lt;cmn:type&gt;SubSpec:-&lt;/cmn:type&gt;
      &lt;smpcbe:primaryKey&gt;210009&lt;/smpcbe:primaryKey&gt;
    &lt;/smp:subKey&gt;
    &lt;smp:orderParamList&gt;
      &lt;smpcmn:param name=&quot;queue_request_flag&quot;&gt;yes&lt;/smpcmn:param&gt;
      &lt;smpcmn:param name=&quot;has_groups&quot;&gt;yes&lt;/smpcmn:param&gt;
    &lt;/smp:orderParamList&gt;
    &lt;smp:orderItemList&gt;
      &lt;smp:orderItem&gt;
        &lt;smp:action&gt;update&lt;/smp:action&gt;
        &lt;smp:itemParamList/&gt;
        &lt;smpsa:entityKey xmlns:smp=&quot;http://www.sigma-systems.com/schemas/3.1/SmpCBEServiceSchema&quot; xsi:type=&quot;smp:SubSvcKeyType&quot;&gt;
          &lt;cmn:type&gt;SubSvcSpec:smp_voice_line&lt;/cmn:type&gt;
          &lt;smp:externalKey&gt;smp_voice_line_10004&lt;/smp:externalKey&gt;
        &lt;/smpsa:entityKey&gt;
        &lt;smpsa:entityValue xmlns:smp=&quot;http://www.sigma-systems.com/schemas/3.1/SmpCBEServiceSchema&quot; xsi:type=&quot;smp:SubSvcType&quot;&gt;
          &lt;cbesvc:serviceState xmlns:smp=&quot;http://www.sigma-systems.com/schemas/3.1/SmpServiceActivationSchema&quot; provisionState=&quot;active&quot; xsi:type=&quot;smp:SubSvcStateType&quot;&gt;active&lt;/cbesvc:serviceState&gt;
          &lt;smp:serviceKey&gt;
            &lt;cmn:type&gt;SubSvcSpec:smp_voice_line&lt;/cmn:type&gt;
            &lt;smp:externalKey&gt;smp_voice_line_10004&lt;/smp:externalKey&gt;
          &lt;/smp:serviceKey&gt;
          &lt;smp:childServiceList&gt;
            &lt;smp:serviceValue&gt;
              &lt;cbesvc:serviceState xmlns:smp=&quot;http://www.sigma-systems.com/schemas/3.1/SmpServiceActivationSchema&quot; provisionState=&quot;active&quot; xsi:type=&quot;smp:SubSvcStateType&quot;&gt;active&lt;/cbesvc:serviceState&gt;
              &lt;smp:serviceKey&gt;
                &lt;cmn:type&gt;SubSvcSpec:smp_switch_dial_tone_access&lt;/cmn:type&gt;
                &lt;smp:externalKey&gt;smp_switch_dial_tone_access_10001&lt;/smp:externalKey&gt;
              &lt;/smp:serviceKey&gt;
              &lt;smp:parentServiceKey&gt;
                &lt;cmn:type&gt;SubSvcSpec:smp_voice_line&lt;/cmn:type&gt;
                &lt;smp:externalKey&gt;smp_voice_line_10004&lt;/smp:externalKey&gt;
              &lt;/smp:parentServiceKey&gt;
              &lt;smp:paramList&gt;
                &lt;smpcbe:param name=&quot;cos_restrict_id&quot;&gt;4&lt;/smpcbe:param&gt;

              &lt;/smp:paramList&gt;
              &lt;smp:associationList&gt;
                &lt;smpcbe:association&gt;
                  &lt;smpcbe:associationType&gt;service_on_address&lt;/smpcbe:associationType&gt;
                  &lt;smp:zEndKey xmlns:smp=&quot;http://www.sigma-systems.com/schemas/3.1/SmpCBECoreSchema&quot; xsi:type=&quot;smp:SubAddressKeyType&quot;&gt;
                    &lt;cmn:type&gt;SubAddress&lt;/cmn:type&gt;
                    &lt;smp:externalKey&gt;primary&lt;/smp:externalKey&gt;
                  &lt;/smp:zEndKey&gt;
                &lt;/smpcbe:association&gt;
                &lt;smpcbe:association&gt;
                  &lt;smpcbe:associationType&gt;dt_has_access&lt;/smpcbe:associationType&gt;
                  &lt;smpcbe:zEndKey xsi:type=&quot;smp:SubSvcKeyType&quot;&gt;
                    &lt;cmn:type&gt;SubSvc&lt;/cmn:type&gt;
                    &lt;smp:externalKey&gt;smp_emta_pc_voip_access_30003&lt;/smp:externalKey&gt;
                  &lt;/smpcbe:zEndKey&gt;
                &lt;/smpcbe:association&gt;
              &lt;/smp:associationList&gt;
            &lt;/smp:serviceValue&gt;
            &lt;smp:serviceValue&gt;
              &lt;cbesvc:serviceState xmlns:smp=&quot;http://www.sigma-systems.com/schemas/3.1/SmpServiceActivationSchema&quot; provisionState=&quot;active&quot; xsi:type=&quot;smp:SubSvcStateType&quot;&gt;active&lt;/cbesvc:serviceState&gt;
              &lt;smp:serviceKey&gt;
                &lt;cmn:type&gt;SubSvcSpec:smp_switch_feature_pkg_std&lt;/cmn:type&gt;
                &lt;smp:externalKey&gt;smp_switch_feature_pkg_std_10002&lt;/smp:externalKey&gt;
              &lt;/smp:serviceKey&gt;
              &lt;smp:parentServiceKey&gt;
                &lt;cmn:type&gt;SubSvcSpec:smp_voice_line&lt;/cmn:type&gt;
                &lt;smp:externalKey&gt;smp_voice_line_10004&lt;/smp:externalKey&gt;
              &lt;/smp:parentServiceKey&gt;
              &lt;smp:paramList&gt;
              &lt;/smp:paramList&gt;
              &lt;smp:associationList&gt;
                &lt;smpcbe:association&gt;
                  &lt;smpcbe:associationType&gt;service_on_address&lt;/smpcbe:associationType&gt;
                  &lt;smp:zEndKey xmlns:smp=&quot;http://www.sigma-systems.com/schemas/3.1/SmpCBECoreSchema&quot; xsi:type=&quot;smp:SubAddressKeyType&quot;&gt;
                    &lt;cmn:type&gt;SubAddress&lt;/cmn:type&gt;
                    &lt;smp:externalKey&gt;primary&lt;/smp:externalKey&gt;
                  &lt;/smp:zEndKey&gt;
                &lt;/smpcbe:association&gt;
              &lt;/smp:associationList&gt;
            &lt;/smp:serviceValue&gt;
          &lt;/smp:childServiceList&gt;
        &lt;/smpsa:entityValue&gt;
      &lt;/smp:orderItem&gt;
      &lt;smp:orderItem&gt;
        &lt;smp:action&gt;update&lt;/smp:action&gt;
        &lt;smp:itemParamList/&gt;
        &lt;smpsa:entityKey xmlns:smp=&quot;http://www.sigma-systems.com/schemas/3.1/SmpCBEServiceSchema&quot; xsi:type=&quot;smp:SubSvcKeyType&quot;&gt;
          &lt;cmn:type&gt;SubSvcSpec:cable_broadband&lt;/cmn:type&gt;
          &lt;smp:externalKey&gt;cable_broadband_20001&lt;/smp:externalKey&gt;
        &lt;/smpsa:entityKey&gt;
        &lt;smpsa:entityValue xmlns:smp=&quot;http://www.sigma-systems.com/schemas/3.1/SmpCBEServiceSchema&quot; xsi:type=&quot;smp:SubSvcType&quot;&gt;
          &lt;cbesvc:serviceState xmlns:smp=&quot;http://www.sigma-systems.com/schemas/3.1/SmpServiceActivationSchema&quot; provisionState=&quot;active&quot; xsi:type=&quot;smp:SubSvcStateType&quot;&gt;active&lt;/cbesvc:serviceState&gt;
          &lt;smp:serviceKey&gt;
            &lt;cmn:type&gt;SubSvcSpec:cable_broadband&lt;/cmn:type&gt;
            &lt;smp:externalKey&gt;cable_broadband_20001&lt;/smp:externalKey&gt;
          &lt;/smp:serviceKey&gt;
          &lt;smp:childServiceList&gt;
            &lt;smp:serviceValue&gt;
              &lt;cbesvc:serviceState xmlns:smp=&quot;http://www.sigma-systems.com/schemas/3.1/SmpServiceActivationSchema&quot; provisionState=&quot;active&quot; xsi:type=&quot;smp:SubSvcStateType&quot;&gt;active&lt;/cbesvc:serviceState&gt;
              &lt;smp:serviceKey&gt;
                &lt;cmn:type&gt;SubSvcSpec:internet_access&lt;/cmn:type&gt;
                &lt;smp:externalKey&gt;internet_access_20002&lt;/smp:externalKey&gt;
              &lt;/smp:serviceKey&gt;
              &lt;smp:parentServiceKey&gt;
                &lt;cmn:type&gt;SubSvcSpec:cable_broadband&lt;/cmn:type&gt;
                &lt;smp:externalKey&gt;cable_broadband_20001&lt;/smp:externalKey&gt;
              &lt;/smp:parentServiceKey&gt;
              &lt;smp:paramList&gt;
                &lt;smpcbe:param name=&quot;rate_codes&quot;&gt;silver&lt;/smpcbe:param&gt;
              &lt;/smp:paramList&gt;
              &lt;smp:associationList&gt;
                &lt;smpcbe:association&gt;
                  &lt;smpcbe:associationType&gt;service_on_address&lt;/smpcbe:associationType&gt;
                  &lt;smp:zEndKey xmlns:smp=&quot;http://www.sigma-systems.com/schemas/3.1/SmpCBECoreSchema&quot; xsi:type=&quot;smp:SubAddressKeyType&quot;&gt;
                    &lt;cmn:type&gt;SubAddress&lt;/cmn:type&gt;
                    &lt;smp:externalKey&gt;primary&lt;/smp:externalKey&gt;
                  &lt;/smp:zEndKey&gt;
                &lt;/smpcbe:association&gt;
              &lt;/smp:associationList&gt;
            &lt;/smp:serviceValue&gt;
            &lt;smp:serviceValue&gt;
              &lt;cbesvc:serviceState xmlns:smp=&quot;http://www.sigma-systems.com/schemas/3.1/SmpServiceActivationSchema&quot; provisionState=&quot;active&quot; xsi:type=&quot;smp:SubSvcStateType&quot;&gt;active&lt;/cbesvc:serviceState&gt;
              &lt;smp:serviceKey&gt;
                &lt;cmn:type&gt;SubSvcSpec:std_cpe&lt;/cmn:type&gt;
                &lt;smp:externalKey&gt;std_cpe_20003&lt;/smp:externalKey&gt;
              &lt;/smp:serviceKey&gt;
              &lt;smp:parentServiceKey&gt;
                &lt;cmn:type&gt;SubSvcSpec:cable_broadband&lt;/cmn:type&gt;
                &lt;smp:externalKey&gt;cable_broadband_20001&lt;/smp:externalKey&gt;
              &lt;/smp:parentServiceKey&gt;
              &lt;smp:paramList&gt;
              &lt;/smp:paramList&gt;
            &lt;/smp:serviceValue&gt;
            &lt;smp:serviceValue&gt;
              &lt;cbesvc:serviceState xmlns:smp=&quot;http://www.sigma-systems.com/schemas/3.1/SmpServiceActivationSchema&quot; provisionState=&quot;active&quot; xsi:type=&quot;smp:SubSvcStateType&quot;&gt;active&lt;/cbesvc:serviceState&gt;
              &lt;smp:serviceKey&gt;
                &lt;cmn:type&gt;SubSvcSpec:additional_cpe&lt;/cmn:type&gt;
                &lt;smp:externalKey&gt;additional_cpe_20004&lt;/smp:externalKey&gt;
              &lt;/smp:serviceKey&gt;
              &lt;smp:parentServiceKey&gt;
                &lt;cmn:type&gt;SubSvcSpec:cable_broadband&lt;/cmn:type&gt;
                &lt;smp:externalKey&gt;cable_broadband_20001&lt;/smp:externalKey&gt;
              &lt;/smp:parentServiceKey&gt;
              &lt;smp:paramList&gt;
             &lt;/smp:paramList&gt;
            &lt;/smp:serviceValue&gt;
            &lt;smp:serviceValue&gt;
              &lt;cbesvc:serviceState xmlns:smp=&quot;http://www.sigma-systems.com/schemas/3.1/SmpServiceActivationSchema&quot; provisionState=&quot;active&quot; xsi:type=&quot;smp:SubSvcStateType&quot;&gt;active&lt;/cbesvc:serviceState&gt;
              &lt;smp:serviceKey&gt;
                &lt;cmn:type&gt;SubSvcSpec:static_ip_cpe&lt;/cmn:type&gt;
                &lt;smp:externalKey&gt;static_ip_cpe_20005&lt;/smp:externalKey&gt;
              &lt;/smp:serviceKey&gt;
              &lt;smp:parentServiceKey&gt;
                &lt;cmn:type&gt;SubSvcSpec:cable_broadband&lt;/cmn:type&gt;
                &lt;smp:externalKey&gt;cable_broadband_20001&lt;/smp:externalKey&gt;
              &lt;/smp:parentServiceKey&gt;
              &lt;smp:paramList&gt;
              &lt;/smp:paramList&gt;
            &lt;/smp:serviceValue&gt;
          &lt;/smp:childServiceList&gt;
        &lt;/smpsa:entityValue&gt;
      &lt;/smp:orderItem&gt;
    &lt;/smp:orderItemList&gt;
  &lt;/smp:orderValue&gt;
&lt;/smpsa:executeOrderRequest&gt;</xmlRequest> 
  </m:executeXml>
  </SOAP-ENV:Body>
  </SOAP-ENV:Envelope>  